tutorials/LES/3DChannel560/AllrunAverage
#!/bin/sh

# Run sedFoam in parallel
mpirun -np 16 sedFoam_rbgh -parallel > log&
